#### BuiltInFailures.DocumentFailures Members

---

|  |
| --- |
| BuiltInFailures DocumentFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures DocumentFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | ApiDelayedUpdateFailed | Delayed Updating Failed. Please contact the 3rd Party Application vendor. |
| Public property Static member | CannotAutoUpdate | Coordination Monitor can't update element |
| Public property Static member | CannotLoadLink | Can't load Linked File [Name] due to errors. Open it separately to investigate the problem. |
| Public property Static member | DUExcessiveRegeneration | Third party updater '[Name]' has caused an infinite loop and its action had to be canceled. |
| Public property Static member | DUMisbehavingUpdater | Third party updater '[Name]' has experienced a problem and its action had to be canceled. |

# See Also

BuiltInFailures DocumentFailures Class

Autodesk.Revit.DB Namespace